jmeter/jmeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Spring Boot - GET" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">MINIKUBE_IP</stringProp>
          <stringProp name="HTTPSampler.port">INGRESS_PORT</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/companies/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJ0ZXN0IiwidHlwIjoiSldUIiwiYWxnIjoiUlMyNTYifQ.eyJzdWIiOiJ0ZXN0IiwibmJmIjoxNTkwMTg1NDkxLCJzY29wZSI6InJlYWQiLCJpc3MiOiJqd3QiLCJleHAiOjE1OTAyNzE4OTEsImlhdCI6MTU5MDE4NTQ5MSwiYXV0aG9yaXRpZXMiOlsiUk9MRV9BRE1JTiJdLCJqdGkiOiJiNGJkZWI4OS01NTRmLTRkMmItYmE2NS1kNmQ1YzUxMDJlOTIifQ.K0Y2t5yHNLi169FUWZZwK5HnRCLoAnmrIWBfyMVfcqBZTKNvQbQdvSwOsLkkSW1uNd93Xpxl5LOI5KWT2JvrNOiqMwYZANo-J5bPtM59Av5V0k5mwukrYda_nz90PeIIkNvTTN6a5uNPLMwdVimWMDneGOK7alnwu9TRzAMh3UFyzq6gEpZH2YIHu8abG7YibN7kUMn799l23CmjeRjKiV1nxJBaZRUzH4aCLIA8j0Dr60ZsEuZX4ZrHfDy-fPAavP4YP-R5v-AwsOEye1_ihF0NQZtGQ-WRlWmSDU9itfF8abxHh9JT1pXIJOjVlwW7GIT9ysOrydc3gRAHThI5Ig</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Quarkus - GET" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">MINIKUBE_IP</stringProp>
          <stringProp name="HTTPSampler.port">INGRESS_PORT</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/quarkus/api/companies/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJ0ZXN0IiwidHlwIjoiSldUIiwiYWxnIjoiUlMyNTYifQ.eyJzdWIiOiJ0ZXN0IiwibmJmIjoxNTkwMTg1NDkxLCJzY29wZSI6InJlYWQiLCJpc3MiOiJqd3QiLCJleHAiOjE1OTAyNzE4OTEsImlhdCI6MTU5MDE4NTQ5MSwiYXV0aG9yaXRpZXMiOlsiUk9MRV9BRE1JTiJdLCJqdGkiOiJiNGJkZWI4OS01NTRmLTRkMmItYmE2NS1kNmQ1YzUxMDJlOTIifQ.K0Y2t5yHNLi169FUWZZwK5HnRCLoAnmrIWBfyMVfcqBZTKNvQbQdvSwOsLkkSW1uNd93Xpxl5LOI5KWT2JvrNOiqMwYZANo-J5bPtM59Av5V0k5mwukrYda_nz90PeIIkNvTTN6a5uNPLMwdVimWMDneGOK7alnwu9TRzAMh3UFyzq6gEpZH2YIHu8abG7YibN7kUMn799l23CmjeRjKiV1nxJBaZRUzH4aCLIA8j0Dr60ZsEuZX4ZrHfDy-fPAavP4YP-R5v-AwsOEye1_ihF0NQZtGQ-WRlWmSDU9itfF8abxHh9JT1pXIJOjVlwW7GIT9ysOrydc3gRAHThI5Ig</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">test_result_springboot</stringProp>
        </ResultCollector>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Spring Boot - POST" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;name&quot;: &quot;spring boot - test jmeter - ${__UUID()}&quot;, &#xd;
	&quot;activated&quot;: true&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">MINIKUBE_IP</stringProp>
          <stringProp name="HTTPSampler.port">INGRESS_PORT</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/companies/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJ0ZXN0IiwidHlwIjoiSldUIiwiYWxnIjoiUlMyNTYifQ.eyJzdWIiOiJ0ZXN0IiwibmJmIjoxNTkwMTg1NDkxLCJzY29wZSI6InJlYWQiLCJpc3MiOiJqd3QiLCJleHAiOjE1OTAyNzE4OTEsImlhdCI6MTU5MDE4NTQ5MSwiYXV0aG9yaXRpZXMiOlsiUk9MRV9BRE1JTiJdLCJqdGkiOiJiNGJkZWI4OS01NTRmLTRkMmItYmE2NS1kNmQ1YzUxMDJlOTIifQ.K0Y2t5yHNLi169FUWZZwK5HnRCLoAnmrIWBfyMVfcqBZTKNvQbQdvSwOsLkkSW1uNd93Xpxl5LOI5KWT2JvrNOiqMwYZANo-J5bPtM59Av5V0k5mwukrYda_nz90PeIIkNvTTN6a5uNPLMwdVimWMDneGOK7alnwu9TRzAMh3UFyzq6gEpZH2YIHu8abG7YibN7kUMn799l23CmjeRjKiV1nxJBaZRUzH4aCLIA8j0Dr60ZsEuZX4ZrHfDy-fPAavP4YP-R5v-AwsOEye1_ihF0NQZtGQ-WRlWmSDU9itfF8abxHh9JT1pXIJOjVlwW7GIT9ysOrydc3gRAHThI5Ig</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Quarkus - POST" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;name&quot;: &quot;quarkus - test jmeter - ${__UUID()}&quot;, &#xd;
	&quot;activated&quot;: true&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">MINIKUBE_IP</stringProp>
          <stringProp name="HTTPSampler.port">INGRESS_PORT</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/quarkus/api/companies/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJ0ZXN0IiwidHlwIjoiSldUIiwiYWxnIjoiUlMyNTYifQ.eyJzdWIiOiJ0ZXN0IiwibmJmIjoxNTkwMTg1NDkxLCJzY29wZSI6InJlYWQiLCJpc3MiOiJqd3QiLCJleHAiOjE1OTAyNzE4OTEsImlhdCI6MTU5MDE4NTQ5MSwiYXV0aG9yaXRpZXMiOlsiUk9MRV9BRE1JTiJdLCJqdGkiOiJiNGJkZWI4OS01NTRmLTRkMmItYmE2NS1kNmQ1YzUxMDJlOTIifQ.K0Y2t5yHNLi169FUWZZwK5HnRCLoAnmrIWBfyMVfcqBZTKNvQbQdvSwOsLkkSW1uNd93Xpxl5LOI5KWT2JvrNOiqMwYZANo-J5bPtM59Av5V0k5mwukrYda_nz90PeIIkNvTTN6a5uNPLMwdVimWMDneGOK7alnwu9TRzAMh3UFyzq6gEpZH2YIHu8abG7YibN7kUMn799l23CmjeRjKiV1nxJBaZRUzH4aCLIA8j0Dr60ZsEuZX4ZrHfDy-fPAavP4YP-R5v-AwsOEye1_ihF0NQZtGQ-WRlWmSDU9itfF8abxHh9JT1pXIJOjVlwW7GIT9ysOrydc3gRAHThI5Ig</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>